Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диллер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СД_ПриОбменеПоискДелатьПоВнутренемуКоду1с</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сви_КодВэбСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сви_ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MagentoID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MagentoGarazhID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MagentoЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыДоговоров_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ГруппыДоговоров_СД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Договора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ManagerModule.bsl
Функция НайтиКонтрагентовПоНомеруТелефона(Номер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект.Код КАК Код,
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 20) ПОДОБНО &Телефон";
	Запрос.УстановитьПараметр("Телефон","%"+Прав(Номер,9));
	Возврат  Запрос.Выполнить().Выгрузить();
КонецФункции 

Функция НайтиКонтрагентовПоНомеруТелефона1(Номер) Экспорт

    // Проверяем, что номер задан
    Если НЕ ЗначениеЗаполнено(Номер) Тогда
        Возврат Новый Массив;
    КонецЕсли;

	// Очищаем номер от всех символов кроме цифр
	НомерЦифры = "";
	Для Индекс = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер, Индекс, 1);
		Если Символ >= "0" И Символ <= "9" Тогда
			НомерЦифры = НомерЦифры + Символ;
		КонецЕсли;
	КонецЦикла;
	// Берём последние 9 цифр (если меньше — берём всё)
	Длина = СтрДлина(НомерЦифры);
	Если Длина > 9 Тогда
		НомерПоиска = Сред(НомерЦифры, Длина-8, 9); // последние 9 цифр
	Иначе
		НомерПоиска = НомерЦифры;
    КонецЕсли;

    // Создаём и выполняем запрос
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   КонтактнаяИнформация.Объект.Код КАК Код,
    |   КонтактнаяИнформация.Объект,
    |   КонтактнаяИнформация.Вид,
    |   КонтактнаяИнформация.Представление
    |ИЗ
    |   РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
    |ГДЕ
    |   КонтактнаяИнформация.Представление ПОДОБНО &Телефон";

    // Параметр с символом % в начале для поиска конца строки
    Запрос.УстановитьПараметр("Телефон", "%" + НомерПоиска);

    // Возврат результатов
    Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция НайтиКонтрагентаПоНомеруТелефона(Номер) Экспорт
	
	Контрагенты = НайтиКонтрагентовПоНомеруТелефона1(Номер);

	Если Контрагенты.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Берем первого найденного
	Возврат Контрагенты[0].Объект;

КонецФункции

Функция ОтобразитьОкноДляНомера(Номер = неопределено, Контрагент = Неопределено) Экспорт
	
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьНомер      = ЗначениеЗаполнено(Номер);
	
	Если не ЕстьКонтрагент и не ЕстьНомер Тогда Возврат Неопределено; КонецЕсли; 
		
	Если не ЕстьКонтрагент И ЕстьНомер Тогда
		Контрагент = НайтиКонтрагентаПоНомеруТелефона(Номер);
	КонецЕсли;  
	
	Если не ЕстьНомер и ЕстьКонтрагент Тогда 	
		Номер = Контрагент.ПолучитьОбъект().ПолучитьНомерТелефона();
	КонецЕсли; 
	
	Форма = ПолучитьОбщуюФорму("Цв_Инфа_По_Контрагенту");	
	Если Форма.Открыта() Тогда
		Форма.Закрыть();
	КонецЕсли;
	Форма = ПолучитьОбщуюФорму("Цв_Инфа_По_Контрагенту"); 
	форма.Номер = Номер; 
	форма.Контрагент = Контрагент;
	форма.Открыть();	
КонецФункции                       

функция ПолучимКонтрагентовТоваровКоторыхНаРеализации() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоговоров_СДДоговора.Договор КАК ДоговорПоставщика,
	               |	ГруппыДоговоров_СДДоговора.Ссылка КАК Ссылка,
	               |	ГруппыДоговоров_СДДоговора.Ссылка.Владелец КАК Поставщик,
	               |	ШаблоныЗагрузкиОстатковПоставщиков_СД.ПочтаПоставщика,
	               |	БП_НастройкаЗагрузкиСчетовКонтрагентовExcel.Ссылка КАК БП_НастройкаЗагрузкиСчетовКонтрагентовExcel
	               |ИЗ
	               |	Справочник.ГруппыДоговоров_СД.Договора КАК ГруппыДоговоров_СДДоговора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД КАК ШаблоныЗагрузкиОстатковПоставщиков_СД
	               |		ПО ГруппыДоговоров_СДДоговора.Ссылка = ШаблоныЗагрузкиОстатковПоставщиков_СД.ГруппаДоговоров
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.БП_НастройкаЗагрузкиСчетовКонтрагентовExcel КАК БП_НастройкаЗагрузкиСчетовКонтрагентовExcel
	               |		ПО ГруппыДоговоров_СДДоговора.Ссылка.Владелец = БП_НастройкаЗагрузкиСчетовКонтрагентовExcel.Контрагент";
	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции
                                                                  
функция ПолучитьПочтуПоставщикаДляОповещенииОПроданомТоваре(Поставщик) Экспорт  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ПочтаПоставщика КАК ПочтаПоставщика	               
				   |ИЗ
	               |	РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних КАК ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних
	               |ГДЕ
	               |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.ПочтаПоставщика;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
